#include "common.h"
#include "task.h"
#include "camera.h"

typedef struct UnkOmicronSub {
    /* 0x00 */ s16 unk_00[2];
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ u8 unk_06;
    /* 0x07 */ u8 unk_07;
} UnkOmicronSub; // size=0x8

typedef struct UnkOmicron {
    /* 0x0000 */ UnkOmicronSub unk_00[512];
    /* 0x1000 */ u16 unk_1000;
    /* 0x1002 */ u16 unk_1002;
    /* 0x1004 */ s32 unk_1004;
    /* 0x1008 */ s32 unk_1008;
} UnkOmicron;

typedef struct UnkQwe {
    /* 0x00 */ s16 unk_00;
    /* 0x04 */ char *unk_04;
} UnkQwe; // size = 8

extern s16 D_8004A730[];
extern s16 D_8004A748[];
extern char D_8004B654[]; // TODO: type
extern char D_8004B674[]; // TODO: type
extern char D_8004B774[]; // TODO: type
extern char D_8004B794[]; // TODO: type
extern UnkQwe D_8004B94C[];
extern PlayerSub5 D_8004C1E8[];

extern s32 D_80080218;
extern UnkOmicron D_80080238;
extern s32 D_80081240;

void func_80012150(PlayerSub6 *arg0, ModelInstance *arg1, Matrix4f *arg2, Matrix4f *arg3, Vec4i *arg4, ColorRGBA *arg5);

void func_80005B70(s16 playerId);
void func_80003C04(Object *obj);

typedef struct AssetDB {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
} AssetDB; // size = 0x44

extern s16 D_8004B9FC[];

#ifdef NON_MATCHING
void func_800035D0(Player *player) {
    UnkOmicronSub *a1;
    u16 t8;
    u16 a2;
    Object *v0;
    s32 v1;
    s32 nv, nv2, nv3;

    v0 = player->obj;

    if (D_80080236 || D_800801F0) {
        return;
    }
    v1 = D_80080238.unk_1002;
    a1 = D_80080238.unk_00 + v1;
    a1->unk_04 = player->unk_78;
    a1->unk_06 = player->playerId;
    a1->unk_07 = 255;

    a2 = player->playerId;
    t8 = 1 - player->playerId;
    a1->unk_00[a2] = v0->playerHp;
    a1->unk_00[t8] = gPlayers[t8].obj->playerHp;

    nv = D_80080238.unk_1002;
    nv2 = (nv - 1) & 0x1FF;
    D_80080238.unk_00[nv2].unk_07 = gFrameCounter - D_80080238.unk_1004;
    nv = (nv + 1) & 0x1FF;
    D_80080238.unk_1002 = nv;
    D_80080238.unk_1004 = gFrameCounter;

    if (D_80080238.unk_1000 == nv) {
        D_80080234 = 1;
        D_80080238.unk_1000 = (D_80080238.unk_1000 + 1) & 0x1FF;
    }
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/41D0/func_800035D0.s")
void func_800035D0(Player *player);
#endif

void func_800036E8(Object *obj) {
    obj->flags |= OBJ_FLAG_DELETE;
    D_80080234 = 1;
}

void func_80003704(Object *obj) {
    if (gPlayers[1 - D_8013C24C].obj->playerHp <= 0 || --obj->vars[0] <= 0) {
        obj->currentTask->start_delay = 55;
        obj->currentTask->func = func_800036E8;
    }
}

#ifdef NON_EQUIVALENT
void func_80003780(Object *obj) {
    s32 s0;
    UnkOmicronSub *s1;
    s32 s3;

    while (TRUE) {
        s0 = D_80080238.unk_1000;
        s1 = &D_80080238.unk_00[s0];
        s3 = s1->unk_06;
        gPlayers[s3].flags |= PLAYER_FLAG_800000;
        player_make_transition(gPlayers + s1->unk_06, TRUE, s1->unk_04);
        gPlayers[s3].obj->playerHp = s1->unk_00[s3];
        if (s1->unk_00[s3] == 0) {
            D_8005BFC0 |= GAME_FLAG_200;
        }

        if (s1->unk_07 == 255) {
            break;
        }

        D_80080238.unk_1000 = (s0 + 1) & 0xFDFF; // ???
        if (s1->unk_07 != 0) {
            obj->currentTask->start_delay = s1->unk_07 - 1;
            return;
        }
    }

    obj->currentTask->func = func_80003704;
    obj->vars[0] = 260;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/41D0/func_80003780.s")
void func_80003780(Object *obj);
#endif

void func_800038C8(Object *obj) {
    task_execute(obj);

    if (gPlayerInput[D_8013C24C].buttons & INP_START) {
        obj->flags |= OBJ_FLAG_DELETE;
        D_80080234 = 1;
        D_8013C23C->currentTask->start_delay = 0;
        D_8013C23C->currentTask->func = func_800177C0;
        gPlayerInput[D_8013C24C].accumulated = FALSE;
    }
}

#ifdef NON_MATCHING
s32 func_80003974(void *arg0) {
    s32 s3;
    Object *v0;
    u32 i;
    s32 temp;

    s3 = gFrameCounter - D_80080238.unk_1008;

    D_80080238.unk_1000 = 0;
    D_8013C250 = 1;
    gPlayers[PLAYER_1].stateId = 0;
    gPlayers[PLAYER_2].stateId = 0;

    func_80005B70(PLAYER_1);
    func_80005B70(PLAYER_2);
    gPlayers[PLAYER_1].obj->frameIndex = 2;
    gPlayers[PLAYER_2].obj->frameIndex = 2;
    model_change_animation(gPlayers[PLAYER_1].obj);
    model_change_animation(gPlayers[PLAYER_2].obj);

    func_80012AF4(&gPlayers[PLAYER_1].unk_750.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_1].unk_868.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_2].unk_750.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_2].unk_868.local_matrix);

    model_update_animated_params(gPlayers[PLAYER_1].obj);
    model_update_animated_params(gPlayers[PLAYER_2].obj);
    gPlayers[PLAYER_1].obj->previousFrameIndex = gPlayers[PLAYER_1].obj->frameIndex;
    gPlayers[PLAYER_2].obj->previousFrameIndex = gPlayers[PLAYER_2].obj->frameIndex;
    gPlayers[PLAYER_1].animTask->flags &= ~TASK_FLAG_FRAME_TRIGGER;
    gPlayers[PLAYER_2].animTask->flags &= ~TASK_FLAG_FRAME_TRIGGER;

    D_8008020C = 0x800;
    func_8002DA08(gCamera);
    gCamera->currentTask->func = func_8002EB2C;
    gCamera->currentTask->start_delay = 0;
    gCameraTarget.x = 0;
    gCameraTarget.z = 0;
    gCameraTarget.y = -400;
    D_8013C834 = FALSE;

    temp = guRandom() % 2;

    if (temp) {}

    v0 = create_worker(func_800038C8, -0x7001 + temp * 0);
    v0->currentTask->func = func_80003780;
    v0->currentTask->start_delay = 0;
    v0->currentTask->flags = TASK_FLAG_ENABLED;

    D_8008012C |= GFX_FLAG_1;
    D_8005BFC0 &= ~GAME_FLAG_200;

    if (s3 > 960) {
        s3 -= 960;
        for (i = 0; i < s3; i++) {
            func_80003C04(gPlayers[PLAYER_1].obj);
            func_80003C04(gPlayers[PLAYER_2].obj);
            func_800038C8(v0);
        }

        func_8002D278(gCamera, TRUE);
    }

    return 0;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/41D0/func_80003974.s")
s32 func_80003974(void *arg0);
#endif

s32 func_80003BB4(void) {
    s32 diff = gFrameCounter - D_80081240;

    if (diff < 60) {
        return FALSE;
    } else {
        set_post_render_hook(func_80003974, NULL);
        return TRUE;
    }
}

void func_80003C04(Object *obj) {
    Player *player = (Player *) obj->varObj[0];
    u16 playerId = player->playerId;
    s32 unused[7];
    ModelInstance *mosInst = obj->modInst;

    if (func_80030BB0(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    task_execute(obj);

    if (mosInst->currentAnimId != mosInst->previousAnimId) {
        model_change_animation(obj);
        mosInst->previousAnimId = mosInst->currentAnimId;
    }

    if (obj->frameIndex != obj->previousFrameIndex) {
        model_process_animation(obj);
        model_update_animated_params(obj);
        obj->previousFrameIndex = obj->frameIndex;
    }

    if (func_80030BB0(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    if (player->unk_184) {
        if (player->moveTimeout != 0 && --player->moveTimeout == 0) {
            player_select_transition(player, TRUE);
        } else if (!(player->flags & (PLAYER_FLAG_TRANSITION_LOCKED | PLAYER_FLAG_100000)) &&
                   gPlayerInput[playerId].accumulated && player->nextLogicState >= 0 &&
                   !(player->animTask->flags & TASK_FLAG_FRAME_TRIGGER)) {
            player_select_transition(player, FALSE);
        }
    }

    player->unk_184 = TRUE;
}

void player_update(Object *obj) {
    Player *player = (Player *) obj->varObj[0];
    u16 playerId = player->playerId;
    u16 oppId;
    Player *opponent;
    ActionState *currentState;
    ActionState *oppState;
    s32 pad[2];
    Object *oppObj;
    u8 pad2;
    u8 sp2E;

    currentState = player->currentState;
    oppId = 1 - playerId;
    opponent = &gPlayers[oppId];
    oppState = opponent->currentState;
    oppObj = opponent->obj;

    if (func_80030BB0(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    model_update(obj);

    if (func_80030BB0(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    sp2E = (currentState->damage != 0) && (obj->frameIndex >= currentState->unk_24) &&
           (obj->frameIndex < currentState->unk_26);

    func_800115A0(&player->unk_DE8, (currentState->flags & STATE_FLAG_40) && sp2E);
    if (player->unk_5F4A) {
        func_800115A0(&player->unk_2240, (currentState->flags & STATE_FLAG_2000) && sp2E);
    }
    func_800115A0(&player->unk_3698, (currentState->flags & STATE_FLAG_800) && sp2E);
    func_800115A0(&player->unk_4AF0, (currentState->flags & (STATE_FLAG_20 | STATE_FLAG_1000)) && sp2E);

    if (player->characterId != MORPHIX) {
        func_80037E28(obj);
    }

    if (gIsPaused) {
        return;
    }

    if (gPlayMode == PLAY_MODE_PRACTICE) {
        if (D_8013C430 == 16) {
            func_800338D0();
        } else if (D_8013C430 == 18) {
            func_80033D64();
        }
        if (D_8013C434 == 66) {
            func_80033D64();
        }
    }

    if (gBattleSettings[playerId].isCpu && !D_800801F0 && !(player->flags & PLAYER_FLAG_100000)) {
        if (!(player->unk_180 & 0x20000)) {
            func_8001B810(player);
        }
        if (D_8013C444 && gPlayerInput[playerId].accumulated && player->nextLogicState >= 0 &&
            !(player->animTask->flags & TASK_FLAG_FRAME_TRIGGER) && !(player->flags & PLAYER_FLAG_2000)) {
            player_select_transition(player, FALSE);
        }
    } else if (player->unk_184 && !D_800801F0) {
        if (player->moveTimeout != 0 && --player->moveTimeout == 0) {
            player_select_transition(player, TRUE);
        } else if (!(player->flags & (PLAYER_FLAG_TRANSITION_LOCKED | PLAYER_FLAG_100000)) &&
                   gPlayerInput[playerId].accumulated && player->nextLogicState >= 0 &&
                   !(player->animTask->flags & TASK_FLAG_FRAME_TRIGGER)) {
            player_select_transition(player, FALSE);
        }
    }

    if (player->unk_5F48 > 0) {
        player->unk_5F48--;
    }

    if (D_80080218 >= D_80080210 && !(player->currentState->flags & STATE_FLAG_40000) && player->unk_5F48 == 0 &&
        oppObj->frameIndex >= oppState->unk_04 && oppObj->frameIndex <= oppState->unk_06) {
        if (oppState->flags & (STATE_FLAG_40 | STATE_FLAG_2000)) {
            if ((player->currentState->flags & (STATE_FLAG_400 | STATE_FLAG_10000 | STATE_FLAG_20000)) &&
                obj->modInst->rootTransform.world_matrix.w.y > -100.0f) {
                func_8000FE9C(player, opponent);
            } else {
                func_8000F494(player, opponent);
            }
        }

        if (player->unk_5F48 == 0 && (oppState->flags & (STATE_FLAG_20 | STATE_FLAG_800 | STATE_FLAG_1000))) {
            if ((player->currentState->flags & (STATE_FLAG_400 | STATE_FLAG_10000 | STATE_FLAG_20000)) &&
                obj->modInst->rootTransform.world_matrix.w.y > -100.0f) {
                func_80010280(player, opponent);
            } else {
                func_8000FB30(player, opponent);
            }
        }
    }

    player->unk_184 = TRUE;
}

void func_80004304(char *arg0, char *arg1, char *arg2) {
    str_copy(arg0, arg1);
    str_concat(arg0, arg2);
}

typedef struct AssetDB2 {
    /* 0x00 */ char unk_00[12];
} AssetDB2; // size = 0xC

typedef struct AssetDB1 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ AssetDB2 unk_04[1];
} AssetDB1;

typedef struct AssetDB3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s16 unk_04[1];
} AssetDB3;

s16 D_80049390 = -1;
s16 D_80049394 = -1;
s32 func_8001C114(Player *); // @fake signature
void func_8001C1C0(Player *);
void func_8001BF40(Player *);
s32 func_8001DFE4(s32 arg0);

void func_80004334(AssetDB *arg0, s16 playerId) {
    AssetDB1 *v1;
    AssetDB3 *a2;
    s32 s2;
    s32 i;
    s32 pad;

    gPlayers[playerId].unk_50 = arg0->unk_30 + (u32) arg0;
    gPlayers[playerId].unk_54 = arg0->unk_34 + (u32) arg0;

    v1 = arg0->unk_38 + (u32) arg0;
    gPlayers[playerId].unk_DB8 = v1->unk_00;
    gPlayers[playerId].unk_58 = v1->unk_04;
    gPlayers[playerId].unk_5C = v1->unk_00 + v1->unk_04; // required to match

    a2 = arg0->unk_3C + (u32) arg0;
    gPlayers[playerId].unk_DBA = a2->unk_00;
    gPlayers[playerId].unk_64 = a2->unk_04;
    gPlayers[playerId].unk_60 = (((a2->unk_00 & 1) + a2->unk_00) & 0xFFFFFFFF) + a2->unk_04; // required to match

    gPlayers[playerId].unk_180 = 0x20000;
    gPlayers[playerId].unk_A8.unk_A8 = 0;
