#include "common.h"
#include "task.h"
#include "camera.h"

typedef struct x_30c860fe {
    /* 0x00 */ s16 x_9200c538[2];
    /* 0x04 */ s16 x_a6423339;
    /* 0x06 */ u8 x_30bbe547;
    /* 0x07 */ u8 x_4deaa42c;
} x_30c860fe; // size=0x8

typedef struct x_64923535 {
    /* 0x0000 */ x_30c860fe x_af0aa1f8[512];
    /* 0x1000 */ u16 x_d0d13a9c;
    /* 0x1002 */ u16 x_ffd925e9;
    /* 0x1004 */ s32 x_69d9d5da;
    /* 0x1008 */ s32 x_77f7a44f;
} x_64923535; // size = 0x100C

extern s16 D_8004A730[];
extern s16 D_8004A748[];
extern x_2bb4cf6f D_8004B644;
extern x_2bb4cf6f D_8004B664;
extern x_2bb4cf6f D_8004B764;
extern x_2bb4cf6f D_8004B784;
extern x_6dac5499 D_8004B94C[];
extern x_edf8d3f1 D_8004C1E8[];

extern s32 D_80080218;
extern x_64923535 D_80080238;

/* .bss */
s16 x_5e4e2788;
s16 x_1acf99bf;
u16 D_80080234;
u16 D_80080236;
x_64923535 D_80080238;

void x_ed9e2514(x_056d4f07 *x_cc1d0de5, x_6fcfcf46 *x_84ff873b, x_f9704fd6 *x_2092f891, x_f9704fd6 *x_ee71e5cb,
                x_88f11482 *x_a0e63e9c, x_6751d717 *x_1011f751);

void x_84aa5a13(s16 x_30bbe547);
void x_252b14e4(Object *obj);

typedef struct x_4a3b281c {
    /* 0x00 */ s32 x_af0aa1f8;
    /* 0x04 */ s32 x_554ac37d;
    /* 0x08 */ s32 x_6e32552b;
    /* 0x0C */ s32 x_b8173ab8;
    /* 0x10 */ s32 x_60c27ea9;
    /* 0x14 */ s32 x_8ebab1d0;
    /* 0x18 */ s32 x_429c730a;
    /* 0x1C */ s32 x_2c79259e;
    /* 0x20 */ s32 x_59f97427;
    /* 0x24 */ s32 x_817784f2;
    /* 0x28 */ s32 x_e4ca14d3;
    /* 0x2C */ s32 x_38b3091d;
    /* 0x30 */ s32 x_49e4c93e;
    /* 0x34 */ s32 x_8cd129ed;
    /* 0x38 */ s32 x_251abb64;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 x_a484ea08;
} x_4a3b281c; // size = 0x44

extern s16 D_8004B9FC[];

#ifdef NON_MATCHING
/**
 * player_replay_record - Record current player state into replay buffer.
 * Captures player index, action ID, opponent state, and timestamps into circular buffer (512 entries).
 * Increments buffer head, tracks frame delta, sets overflow flag when head catches tail.
 * Params: player - Player to record
 */
void x_5f34c321(Player *player) {
    x_30c860fe *a1;
    u16 t8;
    u16 a2;
    Object *v0;
    s32 v1;
    s32 x_b3c51f8a;
    s32 temp;

    v0 = player->obj;

    if (D_80080236 || x_9df63a90) {
        return;
    }
    v1 = D_80080238.x_ffd925e9;
    a1 = D_80080238.x_af0aa1f8 + v1;
    a1->x_a6423339 = player->x_a6423339;
    a1->x_30bbe547 = player->x_30bbe547;
    a1->x_4deaa42c = 255;

    t8 = 1 - player->x_30bbe547;
    a2 = player->x_30bbe547;
    a1->x_9200c538[a2] = v0->x_9200c538;
    a1->x_9200c538[t8] = x_824b9544[t8].obj->x_9200c538;

    x_b3c51f8a = D_80080238.x_ffd925e9;
    D_80080238.x_af0aa1f8[((x_b3c51f8a - 1) & 0x1FF)].x_4deaa42c = gFrameCounter - D_80080238.x_69d9d5da;

    x_b3c51f8a = (x_b3c51f8a + 1) & 0x1FF;
    D_80080238.x_ffd925e9 = x_b3c51f8a;
    D_80080238.x_69d9d5da = gFrameCounter;

    if (x_b3c51f8a == D_80080238.x_d0d13a9c) {
        D_80080234 = 1;
        D_80080238.x_d0d13a9c = (D_80080238.x_d0d13a9c + 1) & 0x1FF;
    }
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/player/x_5f34c321.s")
void x_5f34c321(Player *player);
#endif

/**
 * player_replay_set_overflow - Mark replay buffer as overflowed and set object flag.
 * Called when replay buffer wraps around.
 * Params: obj - Object to flag
 */
void x_6c813c97(Object *obj) {
    obj->flags |= x_f51cb721;
    D_80080234 = 1;
}

/**
 * player_replay_check_timeout - Check if replay playback should end.
 * Ends replay if opponent health <= 0 or replay timer expires.
 * Sets next task to overflow handler with 55-frame delay.
 * Params: obj - replay Object
 */
void x_e3e68cfd(Object *obj) {
    if (x_824b9544[1 - D_8013C24C].obj->x_9200c538 <= 0 || --obj->x_0f4167b4[0] <= 0) {
        obj->currentTask->delay = 55;
        obj->currentTask->callback = x_6c813c97;
    }
}

#ifdef NON_MATCHING
void x_394387b3(Object *obj) {
    s32 s0;
    x_30c860fe *s1;
    s32 s3;
    s16 v0;
    s32 temp;
    Player *s2;

    while (TRUE) {
        s0 = D_80080238.x_d0d13a9c;
        s1 = D_80080238.x_af0aa1f8 + s0;
        s3 = s1->x_30bbe547;

        x_824b9544[s3].flags |= x_cf6c9b89;
        x_9d4a1d61(x_824b9544 + s3, TRUE, s1->x_a6423339);
        v0 = s1->x_9200c538[s3];
        x_824b9544[s3].obj->x_9200c538 = v0;
        if (v0 == 0) {
            x_e30d50d2 |= x_dd99cbfb;
        }

        if (s1->x_4deaa42c == 255) {
            break;
        }

        s0++;
        D_80080238.x_d0d13a9c = s0 & ~0x200;

        temp = s1->x_4deaa42c;

        if (obj && obj && obj) {} // @fake

        if (temp != 0) {
            obj->currentTask->delay = temp - 1;
            return;
        }
    }

    if (s1) {} // @fake
    obj->currentTask->callback = x_e3e68cfd;
    obj->x_0f4167b4[0] = 260;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/player/x_394387b3.s")
void x_394387b3(Object *obj);
#endif

void x_33a76c83(Object *obj) {
    task_execute(obj);

    if (x_59ce598c[D_8013C24C].buttons & x_9cefe76c) {
        obj->flags |= x_f51cb721;
        D_80080234 = 1;
        D_8013C23C->currentTask->delay = 0;
        D_8013C23C->currentTask->callback = x_3da93607;
        x_59ce598c[D_8013C24C].x_c4397934 = FALSE;
    }
}

s32 x_5d1cb2ec(void *x_cc1d0de5) {
    s32 s3;
    Object *v0;
    u32 i;
    s32 temp;

    s3 = gFrameCounter - D_80080238.x_77f7a44f;

    D_80080238.x_d0d13a9c = 0;
    x_33abac12 = 1;
    x_824b9544[x_83106b21].x_cd14c741 = 0;
    x_824b9544[x_6f0b3be3].x_cd14c741 = 0;

    x_84aa5a13(x_83106b21);
    x_84aa5a13(x_6f0b3be3);
    x_824b9544[x_83106b21].obj->frameCounter = 2;
    x_824b9544[x_6f0b3be3].obj->frameCounter = 2;
    x_0f2c2c2a(x_824b9544[x_83106b21].obj);
    x_0f2c2c2a(x_824b9544[x_6f0b3be3].obj);

    x_e5c4361f(&x_824b9544[x_83106b21].x_a4d7c80d.x_3fde9cd9);
    x_e5c4361f(&x_824b9544[x_83106b21].x_022dff72.x_3fde9cd9);
    x_e5c4361f(&x_824b9544[x_6f0b3be3].x_a4d7c80d.x_3fde9cd9);
    x_e5c4361f(&x_824b9544[x_6f0b3be3].x_022dff72.x_3fde9cd9);

    x_2a8d0730(x_824b9544[x_83106b21].obj);
    x_2a8d0730(x_824b9544[x_6f0b3be3].obj);
    x_824b9544[x_83106b21].obj->x_2b06a023 = x_824b9544[x_83106b21].obj->frameCounter;
    x_824b9544[x_6f0b3be3].obj->x_2b06a023 = x_824b9544[x_6f0b3be3].obj->frameCounter;
    x_824b9544[x_83106b21].x_b9252303->flags &= ~TASK_TIME_BASED;
    x_824b9544[x_6f0b3be3].x_b9252303->flags &= ~TASK_TIME_BASED;

    x_09a33777 = 0x800;
    x_70e8be1f(x_f4bce728);
    x_f4bce728->currentTask->callback = x_31bdfdc5;
    x_f4bce728->currentTask->delay = 0;
    x_435c561d.x = x_435c561d.z = 0;
    x_435c561d.y = -400;
    x_6f8aa7af = FALSE;

    temp = guRandom() % 2;

    if (temp) {}

    v0 = x_4495b42c(x_33a76c83, -0x7001 + temp * 0);
    v0->currentTask->callback = x_394387b3;
    v0->currentTask->delay = 0;
    v0->currentTask->flags = TASK_RUNNABLE;

    D_8008012C |= x_f846a903;
    x_e30d50d2 &= ~x_dd99cbfb;

    if (s3 > 960) {
        s3 -= 960;
        for (i = 0; i < s3; i++) {
            x_252b14e4(x_824b9544[x_83106b21].obj);
            x_252b14e4(x_824b9544[x_6f0b3be3].obj);
            x_33a76c83(v0);
        }

        x_076ece50(x_f4bce728, TRUE);
    }

    return 0;
}

s32 x_b89e43c0(void) {
    s32 x_df087996 = gFrameCounter - D_80080238.x_77f7a44f;

    if (x_df087996 < 60) {
        return FALSE;
    } else {
        x_71257e81(x_5d1cb2ec, NULL);
        return TRUE;
    }
}

void x_252b14e4(Object *obj) {
    Player *player = (Player *) obj->x_e2f64c57[0];
    u16 x_30bbe547 = player->x_30bbe547;
    s32 unused[7];
    x_6fcfcf46 *x_3bae2428 = obj->x_20d20338;

    if (x_af5ccc8a(obj)) {
        player->flags |= x_9298c772;
    } else {
        player->flags &= ~x_9298c772;
    }

    task_execute(obj);

    if (x_3bae2428->x_ee205ef9 != x_3bae2428->x_2f4c4ce1) {
        x_0f2c2c2a(obj);
        x_3bae2428->x_2f4c4ce1 = x_3bae2428->x_ee205ef9;
    }

    if (obj->frameCounter != obj->x_2b06a023) {
        x_b6e96a17(obj);
        x_2a8d0730(obj);
        obj->x_2b06a023 = obj->frameCounter;
    }

    if (x_af5ccc8a(obj)) {
        player->flags |= x_9298c772;
    } else {
        player->flags &= ~x_9298c772;
    }

    if (player->x_cadf184a) {
        if (player->x_448f0851 != 0 && --player->x_448f0851 == 0) {
            x_253cc396(player, TRUE);
        } else if (!(player->flags & (x_030d2322 | x_4d950171)) && x_59ce598c[x_30bbe547].x_c4397934 &&
                   player->x_0a8e33d7 >= 0 && !(player->x_b9252303->flags & TASK_TIME_BASED)) {
            x_253cc396(player, FALSE);
        }
    }

    player->x_cadf184a = TRUE;
}

void x_86740bd7(Object *obj) {
    Player *player = (Player *) obj->x_e2f64c57[0];
    u16 x_30bbe547 = player->x_30bbe547;
    u16 x_de68d2a6;
    Player *x_98c4e5a5;
    x_388306ba *x_8cc4f7df;
    x_388306ba *x_0efa5bb1;
    s32 pad[2];
    Object *x_44d73ae1;
    u8 pad2;
    u8 x_36512335;

    x_8cc4f7df = player->x_7f68c36b;
    x_de68d2a6 = 1 - x_30bbe547;
    x_98c4e5a5 = &x_824b9544[x_de68d2a6];
    x_0efa5bb1 = x_98c4e5a5->x_7f68c36b;
    x_44d73ae1 = x_98c4e5a5->obj;

    if (x_af5ccc8a(obj)) {
        player->flags |= x_9298c772;
    } else {
        player->flags &= ~x_9298c772;
    }

    x_0022bfc3(obj);

    if (x_af5ccc8a(obj)) {
        player->flags |= x_9298c772;
    } else {
        player->flags &= ~x_9298c772;
    }

    x_36512335 = (x_8cc4f7df->x_6f5a5c61 != 0) && (obj->frameCounter >= x_8cc4f7df->x_946f41d3) &&
                 (obj->frameCounter < x_8cc4f7df->x_79b8e870);

    x_f7a1a468(&player->x_d8a19723, (x_8cc4f7df->flags & x_74a8ee84) && x_36512335);
    if (player->x_8bc5a2ac) {
        x_f7a1a468(&player->x_238ba16f, (x_8cc4f7df->flags & x_3e0e6012) && x_36512335);
    }
    x_f7a1a468(&player->x_29c9094f, (x_8cc4f7df->flags & x_0fe9e7f2) && x_36512335);
    x_f7a1a468(&player->x_a241ea2a, (x_8cc4f7df->flags & (x_a83332f6 | x_bd969186)) && x_36512335);

    if (player->x_eb1fe45b != x_b52da315) {
        x_5ff12555(obj);
    }

    if (gTaskLock) {
        return;
    }

    if (x_5e4e2788 == x_79c2dc5b) {
        if (D_8013C430 == 16) {
            x_75afee1a();
        } else if (D_8013C430 == 18) {
            x_65b38a11();
        }
        if (D_8013C434 == 66) {
            x_65b38a11();
        }
    }

    if (x_77831b2c[x_30bbe547].x_03604d94 && !x_9df63a90 && !(player->flags & x_4d950171)) {
        if (!(player->x_81570fde.x_b2c79d6e & x_c74d666c)) {
            x_da66d1d5(player);
        }
        if (D_8013C444 && x_59ce598c[x_30bbe547].x_c4397934 && player->x_0a8e33d7 >= 0 &&
            !(player->x_b9252303->flags & TASK_TIME_BASED) && !(player->flags & x_d8a402c3)) {
            x_253cc396(player, FALSE);
        }
    } else if (player->x_cadf184a && !x_9df63a90) {
        if (player->x_448f0851 != 0 && --player->x_448f0851 == 0) {
            x_253cc396(player, TRUE);
        } else if (!(player->flags & (x_030d2322 | x_4d950171)) && x_59ce598c[x_30bbe547].x_c4397934 &&
                   player->x_0a8e33d7 >= 0 && !(player->x_b9252303->flags & TASK_TIME_BASED)) {
            x_253cc396(player, FALSE);
        }
    }

    if (player->x_381817ae > 0) {
        player->x_381817ae--;
    }

    if (x_9a96200f <= D_80080218 && !(player->x_7f68c36b->flags & x_7b8f7fad) && player->x_381817ae == 0 &&
        x_44d73ae1->frameCounter >= x_0efa5bb1->x_c53ac2df && x_44d73ae1->frameCounter <= x_0efa5bb1->x_fedecf5c) {

        if (x_0efa5bb1->flags & (x_74a8ee84 | x_3e0e6012)) {
            if ((player->x_7f68c36b->flags & (x_eac5209f | x_8b64a078 | x_c1df43e1)) &&
                obj->x_20d20338->x_abd7b3c4.x_0c1a9bdd.w.y > -100.0f) {
                x_3fe0a5ec(player, x_98c4e5a5);
            } else {
                x_a617fc50(player, x_98c4e5a5);
            }
        }

        if (player->x_381817ae == 0 && (x_0efa5bb1->flags & (x_a83332f6 | x_0fe9e7f2 | x_bd969186))) {
            if ((player->x_7f68c36b->flags & (x_eac5209f | x_8b64a078 | x_c1df43e1)) &&
                obj->x_20d20338->x_abd7b3c4.x_0c1a9bdd.w.y > -100.0f) {
                x_5a643f96(player, x_98c4e5a5);
            } else {
                x_ec2ec20a(player, x_98c4e5a5);
            }
        }
    }

    player->x_cadf184a = TRUE;
}

void x_4bd2b75c(char *x_cc1d0de5, char *x_84ff873b, char *x_2092f891) {
    x_dab0846a(x_cc1d0de5, x_84ff873b);
    x_8c518b47(x_cc1d0de5, x_2092f891);
}

typedef struct x_c92407e7 {
    /* 0x00 */ char x_af0aa1f8[12];
} x_c92407e7; // size = 0xC

typedef struct x_47670d66 {
    /* 0x00 */ s32 x_af0aa1f8;
    /* 0x04 */ x_c92407e7 x_1256da71[1];
} x_47670d66;

typedef struct x_04bc5bf5 {
    /* 0x00 */ s32 x_af0aa1f8;
    /* 0x04 */ s16 x_1256da71[1];
} x_04bc5bf5;

s16 D_80049390 = -1;
s16 D_80049394 = -1;

void x_5ca8f576(Player *);
void x_c94a154b(Player *);
s32 x_a2f41f91(s32 x_cc1d0de5);

void x_0e475fbe(x_4a3b281c *x_cc1d0de5, s16 x_30bbe547) {
    x_47670d66 *v1;
    x_04bc5bf5 *a2;
    s32 s2;
    s32 i;
    s32 pad;

    x_824b9544[x_30bbe547].x_994b73a7 = x_cc1d0de5->x_49e4c93e + (u32) x_cc1d0de5;
    x_824b9544[x_30bbe547].x_4ec7bbf8 = x_cc1d0de5->x_8cd129ed + (u32) x_cc1d0de5;

    v1 = x_cc1d0de5->x_251abb64 + (u32) x_cc1d0de5;
    x_824b9544[x_30bbe547].x_81ca4eb2 = v1->x_af0aa1f8;
    x_824b9544[x_30bbe547].x_ad9d3e42 = v1->x_1256da71;
    x_824b9544[x_30bbe547].x_d908b580 = v1->x_af0aa1f8 + v1->x_1256da71; // required to match

    a2 = x_cc1d0de5->unk_3C + (u32) x_cc1d0de5;
    x_824b9544[x_30bbe547].x_261980db = a2->x_af0aa1f8;
    x_824b9544[x_30bbe547].x_78242925 = a2->x_1256da71;
    x_824b9544[x_30bbe547].x_0bc74042 =
