#include "common.h"
#include "task.h"
#include "camera.h"

typedef struct TransitionSnapshot {
    /* 0x00 */ s16 playerHp[2];
    /* 0x04 */ s16 currentLogicState;
    /* 0x06 */ u8 playerId;
    /* 0x07 */ u8 delayUntilNext;
} TransitionSnapshot; // size=0x8

typedef struct TransitionRingBuffer {
    /* 0x0000 */ TransitionSnapshot unk_00[512];
    /* 0x1000 */ u16 headIndex;
    /* 0x1002 */ u16 tailIndex;
    /* 0x1004 */ s32 lastFrameCounter;
    /* 0x1008 */ s32 startFrameCounter;
} TransitionRingBuffer; // size = 0x100C

extern s16 D_8004A730[];
extern s16 D_8004A748[];
extern GlobalLighting D_8004B644;
extern GlobalLighting D_8004B664;
extern GlobalLighting D_8004B764;
extern GlobalLighting D_8004B784;
extern UnkQwe D_8004B94C[];
extern Behavior D_8004C1E8[];

extern s32 D_80080218;
extern TransitionRingBuffer D_80080238;

/* .bss */
s16 gPlayMode;
s16 gPreviousPlayMode;
u16 D_80080234;
u16 D_80080236;
TransitionRingBuffer D_80080238;

void hitbox_render_init(PlayerHitbox *arg0, ModelInstance *arg1, Matrix4f *arg2, Matrix4f *arg3, Vec4i *arg4,
                        ColorRGBA *arg5);

void create_player_obj(s16 playerId);
void func_80003C04_unused(Object *obj);

typedef struct CharacterDefinition {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 transitionTable;
    /* 0x08 */ s32 logicStates;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 stateTable;
    /* 0x18 */ s32 soundTable;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 moveToLogicStateMap;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 projectileTable;
    /* 0x2C */ s32 barrageTable;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
} CharacterDefinition; // size = 0x44

extern s16 D_8004B9FC[];

#ifdef NON_MATCHING
void func_800035D0(Player *player) {
    TransitionSnapshot *a1;
    u16 t8;
    u16 a2;
    Object *v0;
    s32 v1;
    s32 nv;
    s32 temp;

    v0 = player->obj;

    if (D_80080236 || gRoundOver) {
        return;
    }
    v1 = D_80080238.tailIndex;
    a1 = D_80080238.unk_00 + v1;
    a1->currentLogicState = player->currentLogicState;
    a1->playerId = player->playerId;
    a1->delayUntilNext = 255;

    t8 = 1 - player->playerId;
    a2 = player->playerId;
    a1->playerHp[a2] = v0->playerHp;
    a1->playerHp[t8] = gPlayers[t8].obj->playerHp;

    nv = D_80080238.tailIndex;
    D_80080238.unk_00[((nv - 1) & 0x1FF)].delayUntilNext = gFrameCounter - D_80080238.lastFrameCounter;

    nv = (nv + 1) & 0x1FF;
    D_80080238.tailIndex = nv;
    D_80080238.lastFrameCounter = gFrameCounter;

    if (nv == D_80080238.headIndex) {
        D_80080234 = 1;
        D_80080238.headIndex = (D_80080238.headIndex + 1) & 0x1FF;
    }
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/player/func_800035D0.s")
void func_800035D0(Player *player);
#endif

void func_800036E8(Object *obj) {
    obj->flags |= OBJ_FLAG_DELETE;
    D_80080234 = 1;
}

void func_80003704(Object *obj) {
    if (gPlayers[1 - D_8013C24C].obj->playerHp <= 0 || --obj->vars[0] <= 0) {
        obj->currentTask->start_delay = 55;
        obj->currentTask->func = func_800036E8;
    }
}

#ifdef NON_MATCHING
void func_80003780(Object *obj) {
    s32 s0;
    TransitionSnapshot *s1;
    s32 s3;
    s16 v0;
    s32 temp;
    Player *s2;

    while (TRUE) {
        s0 = D_80080238.headIndex;
        s1 = D_80080238.unk_00 + s0;
        s3 = s1->playerId;

        gPlayers[s3].flags |= PLAYER_FLAG_800000;
        player_make_transition(gPlayers + s3, TRUE, s1->currentLogicState);
        v0 = s1->playerHp[s3];
        gPlayers[s3].obj->playerHp = v0;
        if (v0 == 0) {
            gGlobalFlags |= GAME_FLAG_BATTLE_FINISHED;
        }

        if (s1->delayUntilNext == 255) {
            break;
        }

        s0++;
        D_80080238.headIndex = s0 & ~0x200;

        temp = s1->delayUntilNext;

        if (obj && obj && obj) {} // @fake

        if (temp != 0) {
            obj->currentTask->start_delay = temp - 1;
            return;
        }
    }

    if (s1) {} // @fake
    obj->currentTask->func = func_80003704;
    obj->vars[0] = 260;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/player/func_80003780.s")
void func_80003780(Object *obj);
#endif

void func_800038C8(Object *obj) {
    task_execute(obj);

    if (gPlayerInput[D_8013C24C].buttons & INP_START) {
        obj->flags |= OBJ_FLAG_DELETE;
        D_80080234 = 1;
        D_8013C23C->currentTask->start_delay = 0;
        D_8013C23C->currentTask->func = func_800177C0;
        gPlayerInput[D_8013C24C].pendingInput = FALSE;
    }
}

s32 func_80003974_unused(void *arg0) {
    s32 s3;
    Object *v0;
    u32 i;
    s32 temp;

    s3 = gFrameCounter - D_80080238.startFrameCounter;

    D_80080238.headIndex = 0;
    gReplayActive = 1;
    gPlayers[PLAYER_1].combatStateId = 0;
    gPlayers[PLAYER_2].combatStateId = 0;

    create_player_obj(PLAYER_1);
    create_player_obj(PLAYER_2);
    gPlayers[PLAYER_1].obj->frameIndex = 2;
    gPlayers[PLAYER_2].obj->frameIndex = 2;
    model_change_animation(gPlayers[PLAYER_1].obj);
    model_change_animation(gPlayers[PLAYER_2].obj);

    func_80012AF4(&gPlayers[PLAYER_1].unk_750.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_1].unk_868.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_2].unk_750.local_matrix);
    func_80012AF4(&gPlayers[PLAYER_2].unk_868.local_matrix);

    model_update_animated_params(gPlayers[PLAYER_1].obj);
    model_update_animated_params(gPlayers[PLAYER_2].obj);
    gPlayers[PLAYER_1].obj->previousFrameIndex = gPlayers[PLAYER_1].obj->frameIndex;
    gPlayers[PLAYER_2].obj->previousFrameIndex = gPlayers[PLAYER_2].obj->frameIndex;
    gPlayers[PLAYER_1].animTask->flags &= ~TASK_FLAG_TRIGGER_FRAME;
    gPlayers[PLAYER_2].animTask->flags &= ~TASK_FLAG_TRIGGER_FRAME;

    gPlayerAngle = 0x800;
    camera_orbit_init(gCamera);
    gCamera->currentTask->func = camera_battle_update;
    gCamera->currentTask->start_delay = 0;
    gCameraTarget.x = gCameraTarget.z = 0;
    gCameraTarget.y = -400;
    sCutsceneAnimDone = FALSE;

    temp = guRandom() % 2;

    if (temp) {}

    v0 = create_worker(func_800038C8, -0x7001 + temp * 0);
    v0->currentTask->func = func_80003780;
    v0->currentTask->start_delay = 0;
    v0->currentTask->flags = TASK_FLAG_ENABLED;

    D_8008012C |= GFX_FLAG_1;
    gGlobalFlags &= ~GAME_FLAG_BATTLE_FINISHED;

    if (s3 > 960) {
        s3 -= 960;
        for (i = 0; i < s3; i++) {
            func_80003C04_unused(gPlayers[PLAYER_1].obj);
            func_80003C04_unused(gPlayers[PLAYER_2].obj);
            func_800038C8(v0);
        }

        camera_orbit_update(gCamera, TRUE);
    }

    return 0;
}

s32 func_80003BB4_unused(void) {
    s32 diff = gFrameCounter - D_80080238.startFrameCounter;

    if (diff < 60) {
        return FALSE;
    } else {
        set_post_render_hook(func_80003974_unused, NULL);
        return TRUE;
    }
}

void func_80003C04_unused(Object *obj) {
    Player *player = (Player *) obj->varObj[0];
    u16 playerId = player->playerId;
    s32 unused[7];
    ModelInstance *mosInst = obj->modInst;

    if (player_check_func_2(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    task_execute(obj);

    if (mosInst->currentAnimId != mosInst->previousAnimId) {
        model_change_animation(obj);
        mosInst->previousAnimId = mosInst->currentAnimId;
    }

    if (obj->frameIndex != obj->previousFrameIndex) {
        model_process_animation(obj);
        model_update_animated_params(obj);
        obj->previousFrameIndex = obj->frameIndex;
    }

    if (player_check_func_2(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    if (player->allowTransition) {
        if (player->autoTransitionTimer != 0 && --player->autoTransitionTimer == 0) {
            player_select_transition(player, TRUE);
        } else if (!(player->flags & (PLAYER_FLAG_TRANSITION_LOCKED | PLAYER_FLAG_100000)) &&
                   gPlayerInput[playerId].pendingInput && player->lookupLogicTable >= 0 &&
                   !(player->animTask->flags & TASK_FLAG_TRIGGER_FRAME)) {
            player_select_transition(player, FALSE);
        }
    }

    player->allowTransition = TRUE;
}

void player_update(Object *obj) {
    Player *player = (Player *) obj->varObj[0];
    u16 playerId = player->playerId;
    u16 oppId;
    Player *opponent;
    CombatState *currentState;
    CombatState *oppState;
    s32 pad[2];
    Object *oppObj;
    u8 pad2;
    u8 sp2E;

    currentState = player->combatState;
    oppId = 1 - playerId;
    opponent = &gPlayers[oppId];
    oppState = opponent->combatState;
    oppObj = opponent->obj;

    if (player_check_func_2(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    model_update(obj);

    if (player_check_func_2(obj)) {
        player->flags |= PLAYER_FLAG_NOT_FACING_OPP;
    } else {
        player->flags &= ~PLAYER_FLAG_NOT_FACING_OPP;
    }

    sp2E = (currentState->damage != 0) && (obj->frameIndex >= currentState->bodyHitboxStart) &&
           (obj->frameIndex < currentState->bodyHitboxEnd);

    hitbox_render_update(&player->unk_DE8, (currentState->flags & CSF_40) && sp2E);
    if (player->unk_5F4A) {
        hitbox_render_update(&player->unk_2240, (currentState->flags & CSF_2000) && sp2E);
    }
    hitbox_render_update(&player->unk_3698, (currentState->flags & CSF_800) && sp2E);
    hitbox_render_update(&player->unk_4AF0, (currentState->flags & (CSF_20 | CSF_1000)) && sp2E);

    if (player->characterId != MORPHIX) {
        func_80037E28(obj);
    }

    if (gIsPaused) {
        return;
    }

    if (gPlayMode == PLAY_MODE_PRACTICE) {
        if (D_8013C430 == 16) {
            func_800338D0();
        } else if (D_8013C430 == 18) {
            func_80033D64();
        }
        if (D_8013C434 == 66) {
            func_80033D64();
        }
    }

    if (gBattleSettings[playerId].isCpu && !gRoundOver && !(player->flags & PLAYER_FLAG_100000)) {
        if (!(player->aiState.aiFlags & AIF_20000)) {
            ai_update(player);
        }
        if (D_8013C444 && gPlayerInput[playerId].pendingInput && player->lookupLogicTable >= 0 &&
            !(player->animTask->flags & TASK_FLAG_TRIGGER_FRAME) && !(player->flags & PLAYER_FLAG_2000)) {
            player_select_transition(player, FALSE);
        }
    } else if (player->allowTransition && !gRoundOver) {
        if (player->autoTransitionTimer != 0 && --player->autoTransitionTimer == 0) {
            player_select_transition(player, TRUE);
        } else if (!(player->flags & (PLAYER_FLAG_TRANSITION_LOCKED | PLAYER_FLAG_100000)) &&
                   gPlayerInput[playerId].pendingInput && player->lookupLogicTable >= 0 &&
                   !(player->animTask->flags & TASK_FLAG_TRIGGER_FRAME)) {
            player_select_transition(player, FALSE);
        }
    }

    if (player->hitCooldown > 0) {
        player->hitCooldown--;
    }

    if (gPlayerDistance <= D_80080218 && !(player->combatState->flags & CSF_INVINSIBLE) && player->hitCooldown == 0 &&
        oppObj->frameIndex >= oppState->hitboxActiveStart && oppObj->frameIndex <= oppState->hitboxActiveEnd) {

        if (oppState->flags & (CSF_40 | CSF_2000)) {
            if ((player->combatState->flags & (CSF_400 | CSF_10000 | CSF_JUGGLED)) &&
                obj->modInst->rootTransform.world_matrix.w.y > -100.0f) {
                check_ground_hit_1(player, opponent);
            } else {
                check_air_hit_1(player, opponent);
            }
        }

        if (player->hitCooldown == 0 && (oppState->flags & (CSF_20 | CSF_800 | CSF_1000))) {
            if ((player->combatState->flags & (CSF_400 | CSF_10000 | CSF_JUGGLED)) &&
                obj->modInst->rootTransform.world_matrix.w.y > -100.0f) {
                check_ground_hit_2(player, opponent);
            } else {
                check_air_hit_2(player, opponent);
            }
        }
    }

    player->allowTransition = TRUE;
}

void func_80004304(char *arg0, char *arg1, char *arg2) {
    str_copy(arg0, arg1);
    str_concat(arg0, arg2);
}

typedef struct AssetDB2 {
    /* 0x00 */ char unk_00[12];
} AssetDB2; // size = 0xC

typedef struct AssetDB1 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ AssetDB2 unk_04[1];
} AssetDB1;

typedef struct AssetDB3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s16 unk_04[1];
} AssetDB3;

s16 D_80049390 = -1;
s16 D_80049394 = -1;

void ai_set_temp_max_difficulty(Player *);
void ai_increase_difficulty(Player *);
s32 func_8001DFE4(s32 arg0);

void func_80004334(CharacterDefinition *arg0, s16 playerId) {
    AssetDB1 *v1;
    AssetDB3 *a2;
    s32 s2;
    s32 i;
    s32 pad;

    gPlayers[playerId].aiActionTable = arg0->unk_30 + (u32) arg0;
    gPlayers[playerId].aiActionIndexMap = arg0->unk_34 + (u32) arg0;

    v1 = arg0->unk_38 + (u32) arg0;
    gPlayers[playerId].unk_DB8 = v1->unk_00;
    gPlayers[playerId].aiCandidateTable = v1->unk_04;
    gPlayers[playerId].aiSequenceTable = v1->unk_00 + v1->unk_04; // required to match

    a2 = arg0->unk_3C + (u32) arg0;
    gPlayers[playerId].unk_DBA = a2->unk_00;
    gPlayers[playerId].aiResponseIndexMap = a2->unk_04;
    gPlayers[playerId].aiResponseTable =
        (((a2->unk_00 & 1) + a2->unk_00) & 0xFFFFFFFF) + a2->unk_04; // required to match

