#include "common.h"
#include "ld_addrs.h"
#include "string.h"
#include "PR/gt.h"

enum x_94e9bb96 {
    x_abbfa82d = 0,
    x_9a28a0e8 = 1,
    x_a2efc39c = 2,
    x_4f58385b = 3,
    x_e78214f3 = 4,
    x_af80c4c4 = 5,
    x_62b457ad = 6,
    x_a333ecc9 = 7,
    x_fbd3116b = 8,
    x_33701dde = 9,
    x_343dc94b = 10,
    x_8b91feb4 = 11,
    x_079fabb5 = 12,
    x_6fc08d0e = 13,
    x_6eac6883 = 14,
    x_d15f1ef4 = 15,
    x_08983e66 = 16,
    x_b4b41045 = 17,
    x_e9a94289 = 18,
    x_0abe41d8 = 19,
    x_f24d8020 = 20,
    x_f83b5104 = 21,
    x_6bfea1ff = 22
};

typedef struct x_f56bf0e5 {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 x_a0917d8d;
    /* 0x1C */ s32 x_d88e3a03;
} x_f56bf0e5; // size >= 0x20

typedef struct x_e28b4412 {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 type;
    /* 0x1C */ s32 size;
    /* 0x20 */ s32 x_f1860703;
} x_e28b4412; // size = 0x24

typedef struct x_909544ae {
    /* 0x00 */ u32 x_c6a89d30;
    /* 0x04 */ u32 x_1256da71; // unknown, same as numFolders
    /* 0x08 */ x_f56bf0e5 x_63b85330[1];
} x_909544ae;

typedef struct x_8e2f21bf {
    /* 0x00 */ s32 x_af0aa1f8;
    /* 0x04 */ s32 x_1256da71[1];
} x_8e2f21bf;

s32 x_646456b5 = 0;

x_80d298c9 x_b717ed65[256];
s32 D_8013C200;
x_909544ae *x_897e2c89;
s32 D_8013C208;
u8 *x_77d8d882;
x_f56bf0e5 *x_51ce9d2c;
s32 D_8013C214;
s32 D_8013C218;
u32 x_456f0177;
u32 x_aaf3898b;
s16 x_2615d8ad;
s16 D_8013C226;
void (*D_8013C228)(x_80d298c9 *);

void x_e6e6fcf8(ALBankFile *x_cc1d0de5, u8 *x_84ff873b, u32 x_2092f891);
void x_0be47d8a(u32 *dest, u32 *src, u32 size);
void x_36b7cd1c(x_13162abc *, s32);
void x_f8c73c4c(x_82e80914 *, x_13162abc *, char *, s32, u16);
void x_69c2895e(x_80d298c9 *);
void x_ef5a0926(s32);
void x_f4b1f18f(void);
void x_07194b79(s32 romAddr, void *x_dda6dc06, s32 size);
void x_1a472aba(Model *, x_13162abc *, char *, s32, x_d8e0705d *, u16);
void x_aced8439(Model *);
void x_0aa2034a(Model *);

void x_ac647f84(x_80d298c9 *);
void x_cdb51e25(x_80d298c9 *);
void x_b36d80d1(x_13162abc *);

void x_034d49df(x_80d298c9 *);
void x_c9891aed(x_80d298c9 *);
void x_d1e0523b(x_80d298c9 *);
