#include "common.h"
#include "ld_addrs.h"
#include "string.h"

enum WadFileTypes {
    WAD_FILE_ANM = 0,
    WAD_FILE_TEX = 1,
    WAD_FILE_SP2 = 2,
    WAD_FILE_3 = 3,
    WAD_FILE_WAD = 4,
    WAD_FILE_DB = 5,
    WAD_FILE_PCL = 6,
    WAD_FILE_GMD = 7,
    WAD_FILE_TMD = 8,
    WAD_FILE_SEQ = 9,
    WAD_FILE_CTL = 10,
    WAD_FILE_TBL = 11,
    WAD_FILE_SP3 = 12,
    WAD_FILE_SFB = 13,
    WAD_FILE_SFX = 14,
    WAD_FILE_K2 = 15,
    WAD_FILE_MOV = 16,
    WAD_FILE_OC = 17,
    WAD_FILE_SYM = 18,
    WAD_FILE_VOX = 19,
    WAD_FILE_K3 = 20,
    WAD_FILE_K4 = 21,
    WAD_FILE_K5 = 22
};

typedef struct WadFolder {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 numFiles;
    /* 0x1C */ s32 folderIndex;
} WadFolder; // size >= 0x20

typedef struct WadFileEntry {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 type;
    /* 0x1C */ s32 size;
    /* 0x20 */ s32 unpackedSize;
} WadFileEntry; // size = 0x24

typedef struct WadFile {
    /* 0x00 */ u32 numFolders;
    /* 0x04 */ u32 unk_04; // unknown, same as numFolders
    /* 0x08 */ WadFolder folders[1];
} WadFile;

typedef struct AssetSP2Sub2 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ TextureAsset *unk_0C;
} AssetSP2Sub2; // size = 0x10

typedef struct AssetSP2 {
    /* 0x00 */ s32 unk_00;
    /* 0x00 */ u32 unk_04;
    /* 0x00 */ char unk_08[4][16];
    /* 0x48 */ AssetSP2Sub2 *unk_48;
} AssetSP2;

typedef struct AssetGmdSub1 {
    /* 0x00 */ char unk_00[0x10];
} AssetGmdSub1; // size = 0x10

typedef struct AssetGmdSub2 {
    /* 0x00 */ char unk_00[0x20];
} AssetGmdSub2; // size = 0x20

typedef struct AssetGmd {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ char unk_04[0xC4];
    /* 0xC8 */ u8 unk_C8;
} AssetGmd; // size = 0xCC

typedef struct AssetUnkHeader {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
} AssetUnkHeader;

typedef struct UnkFrodo {
    /* 0x00 */ char unk_00[0xA68];
} UnkFrodo; // szie = 0xA68

typedef struct UnkSam {
    /* 0x000 */ char unk_00[0x3CC];
    /* 0x3CC */ s32 unk_3CC;
} UnkSam; // szie = 0x3D0

typedef struct UnkFish {
    u8 unk_00;
    char unk_01[17];
} UnkFish;

extern s32 gNumAssets;

extern Asset gAssets[256];
extern s32 D_8013C200;
extern WadFile *gWadFile;
extern s32 D_8013C208;
extern u8 *gWadRomAddress;
extern WadFolder *gWadCurrentFolder;
extern s32 D_8013C214;
extern s32 D_8013C218;
extern u32 gWadNumFiles;
extern u32 gWadNumFolders;

extern u8 D_80049920[];
extern u8 D_80049938[];
extern u8 D_80049950[];
extern u8 D_80049968[];
extern ALBankFile *gMusicBankFile;
extern s32 gMusicBankFileSize;
extern u8 gMusicIsPlaying;
extern ALSeqPlayer *gMusicPlayer;
extern ALSeq *gMusicSequence;
extern s32 gMusicVolume;
extern u8 *gCurrentSongData;
extern s32 gCurrentSongDataSize;
extern ALSeqMarker gMusicMarkerStart;
extern ALSeqMarker gMusicMarkerEnd;
extern ALBankFile *gAudioBankFiles[3];
extern u8 gSfxPlayerOn[];
extern void (*D_8013C228)(Asset *);

extern s32 gMusicVolumeFading;

extern s8 D_8004A472;
