#include "common.h"
#include "ld_addrs.h"
#include "string.h"
#include "PR/gt.h"

enum WadFileType {
    WAD_ANM = 0,
    WAD_TEX = 1,
    WAD_SP2 = 2,
    WAD_KMD = 3,
    WAD_WAD = 4,
    WAD_DB = 5,
    WAD_PCL = 6,
    WAD_GMD = 7,
    WAD_TMD = 8,
    WAD_SEQ = 9,
    WAD_CTL = 10,
    WAD_TBL = 11,
    WAD_SP3 = 12,
    WAD_SFB = 13,
    WAD_SFX = 14,
    WAD_K2 = 15,
    WAD_MOV = 16,
    WAD_OC = 17,
    WAD_SYM = 18,
    WAD_VOX = 19,
    WAD_K3 = 20,
    WAD_K4 = 21,
    WAD_K5 = 22
};

typedef struct WadFolder {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 x_a0917d8d;
    /* 0x1C */ s32 x_d88e3a03;
} WadFolder; // size >= 0x20

typedef struct WadFileEntry {
    /* 0x00 */ char name[20];
    /* 0x14 */ s32 offset;
    /* 0x18 */ s32 type;
    /* 0x1C */ s32 size;
    /* 0x20 */ s32 x_f1860703;
} WadFileEntry; // size = 0x24

typedef struct WadHeader {
    /* 0x00 */ u32 x_c6a89d30;
    /* 0x04 */ u32 x_1256da71; // unknown, same as numFolders
    /* 0x08 */ WadFolder x_63b85330[1];
} WadHeader;

typedef struct WadAnmHeader {
    /* 0x00 */ s32 x_af0aa1f8;
    /* 0x04 */ s32 x_1256da71[1];
} WadAnmHeader;

s32 sWadEntryCount = 0;

x_80d298c9 sWadEntries[256];
s32 sWadHeader;
WadHeader *sWadHeaderPtr;
s32 sWadDataEnd;
u8 *sWadDataPtr;
WadFolder *sWadFolder;
s32 sWadBufferSizeHdr;
s32 sWadBufferSizeData;
u32 sWadFileCount;
u32 sWadFolderCount;
s16 sWadUnk1;
s16 sWadUnk2;
void (*sWadMovCallback)(x_80d298c9 *);

void wad_setup_sfx_bank(ALBankFile *x_cc1d0de5, u8 *x_84ff873b, u32 x_2092f891);
void mem_copy_overlap(u32 *dest, u32 *src, u32 size);
void anim_buffer_resolve(x_13162abc *, s32);
void model_scaffold_register(x_82e80914 *, x_13162abc *, char *, s32, u16);
void lzhuf_start(x_80d298c9 *);
void wad_load_all(s32);
void wad_compact_entries(void);
void dma_read_sync(s32 romAddr, void *x_dda6dc06, s32 size);
void model_create_from_kmd(Model *, x_13162abc *, char *, s32, x_d8e0705d *, u16);
void model_bone_setup(Model *);
void model_anim_setup(Model *);

void wad_entry_free(x_80d298c9 *);
void wad_resolve_kmd(x_80d298c9 *);
